# Limpieza de DF de Proyecto

## Limpieza


1. ✔️Convención de nomenclatura: minúscula y _ en vez de espacios 
2. ✔️Estandarización de booleanos : Y/N(general), F/M(gender) 
3. ✔️Eliminar columnas no necesarias: standard_hours, number_children, salary, over18, employee_count.
3. ✔️(b) Borrar same_as_monthly_income por estar repetida. Y years_in_current_role solo hay 34 datos. date_birth borrada pq nos quedamos con age
4. ✔️Algunas columnas, como la columna DailyRate son columnas que incluyen valores numéricos decimales. Pero en el DataFrame aparece como columna de tipo string. Deberás ahcer los cambios necesarios para convertirla en columna de tipo numérica.
5. ✔️Evaluar si hay valores duplicados y analizar si tiene sentido eliminarlos o mantenerlos
6. ✔️Valores inconsistentes, por ejemplo en la columna DistanceFromHome tiene valores negativos.
7. Errores tipográficos en algunos valores de las columnas categóricas. Por ejemplo, en la columna MaritalStatus en vez de "Married" en algunas filas aparece "Marreid".
8. ✔️Columnas redundantes, es decir, columnas que nos dan la misma información expresada de forma diferente.
9. Redondear a dos decimales (DistanceFromHome...) 
10. DistanceFromHome numero negativo
11. EmployeeNumber tiene nulos, ¿id + indice?
12. ✔️Todos los salarios  quitar $ y pasar tipo a int
13. ✔️Salario no válido, cantidad
14. ✔️JobRole estandarizar mayusculas
16. ✔️DateBirth cambiar a Year (nos interesa la edad) (borramos directamente)
17. ✔️WorkLifeBalance yperformance_rating quitar decimal
18. Nulos de cada columna

In [40]:
import pandas as pd
import numpy as np
import re

In [41]:
rh  = pd.read_csv("HR_RAW_DATA.csv", index_col = 0)
pd.set_option("display.max.columns", None)

In [42]:
rh.sample(15)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
436,44,No,NaN,"1313,0$",NaN,7,3,Medical,1,"1608,0",2,1,31,3,5,REsearcH DiREcToR,4,NaN,NaN,3549,0,NaN,Yes,14,NaN,4,"80,0",1,NaN,4,"2,0",22,NaN,1,10,NaN,1979,1000000000$,NaN,NaN,0
1048,30,No,NaN,nan$,NaN,7,4,Marketing,1,"1428,0",4,1,73,3,2,sALES exEcuTIVe,1,Divorced,NaN,12761,7,NaN,No,14,"3,0",2,"80,0",2,NaN,3,"3,0",3,NaN,0,2,NaN,1993,1000000000$,NaN,NaN,1
86,39,No,travel_rarely,"1132,0$",Research & Development,1,3,NaN,1,NaN,3,0,48,4,3,healTHCAre rePREseNtATiVE,4,NaN,"9613,0",10942,0,NaN,No,17,NaN,1,"80,0",3,"19,0",5,"2,0",18,NaN,3,7,"9613,0",1984,1000000000$,healTHCAre rePREseNtATiVE - Research & Deve...,NaN,0
847,30,Yes,NaN,"1005,0$",NaN,3,3,Technical Degree,1,"297,0",4,1,88,3,1,ReSeArcH ScIenTIsT,1,NaN,"2657,0",8556,5,NaN,Yes,11,"3,0",3,NaN,0,"8,0",5,"3,0",5,NaN,0,4,"2657,0",1993,1000000000$,NaN,NaN,True
564,28,No,NaN,"120,0$",NaN,4,3,Medical,1,"129,0",2,0,43,3,2,sales ExEcUtiVe,3,NaN,"4221,0",8863,1,Y,NaN,15,"3,0",2,"80,0",0,"5,0",3,"4,0",5,NaN,0,4,"4221,0",1995,1000000000$,NaN,NaN,Yes
368,39,No,travel_rarely,"903,0$",NaN,2,5,NaN,1,NaN,1,0,41,4,3,saLEs exEcUTIVe,3,Single,NaN,2560,0,NaN,No,18,"3,0",4,NaN,0,"9,0",3,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,0
1173,27,No,NaN,"1450,0$",NaN,3,3,NaN,1,"224,0",3,0,79,2,1,rEseaRch sCieNTIsT,3,Divorced,"2566,0",25326,1,Y,NaN,15,"3,0",4,NaN,1,"1,0",2,"2,0",1,NaN,0,1,"2566,0",1996,1000000000$,NaN,NaN,1
1601,28,No,NaN,"760,0$",Sales,-43,4,NaN,1,NaN,43,1,81,3,2,SaLEs ExECUtiVE,2,NaN,NaN,3698,1,Y,NaN,20,"4,0",1,NaN,0,"8,0",2,"3,0",8,NaN,7,5,NaN,1995,1000000000$,SaLEs ExECUtiVE - Sales,NaN,0
958,44,No,travel_rarely,"986,0$",NaN,8,4,Life Sciences,1,"874,0",1,0,62,4,1,LAbORaToRY TecHNICiAn,4,NaN,NaN,5044,2,NaN,Yes,24,"4,0",3,NaN,1,"10,0",2,"2,0",3,NaN,0,2,NaN,1979,1000000000$,NaN,NaN,False
1118,29,Yes,travel_rarely,"428,0$",NaN,9,3,NaN,1,NaN,2,1,Not Available,1,1,salES rePResEntatIve,2,Single,"2760,0",14630,1,NaN,NaN,13,"3,0",3,"80,0",0,"2,0",3,"3,0",2,NaN,2,2,"2760,0",1994,1000000000$,NaN,NaN,1
1164,35,No,travel_frequently,"1199,0$",NaN,18,4,Life Sciences,1,NaN,3,0,80,3,2,HEAlTHCarE REPResEnTaTIve,3,NaN,NaN,24594,1,NaN,NaN,14,"3,0",4,"80,0",2,NaN,2,"4,0",10,NaN,0,2,NaN,1988,1000000000$,NaN,NaN,0
283,36,No,travel_frequently,"1480,0$",Research & Development,3,2,NaN,1,NaN,4,0,30,3,1,lABorATOrY TeChnICIan,2,NaN,NaN,15062,4,Y,No,12,NaN,3,NaN,0,"13,0",3,"2,0",8,NaN,7,2,NaN,1987,1000000000$,lABorATOrY TeChnICIan - Research & Developm...,NaN,True
1422,32,Yes,travel_rarely,"1259,0$",NaN,2,4,Life Sciences,1,NaN,4,0,95,3,1,LAbOrATORY tEChNiciAn,2,Single,"1393,0",24852,1,NaN,No,12,"3,0",1,NaN,0,"1,0",2,"3,0",1,NaN,0,0,"1393,0",1991,1000000000$,NaN,NaN,1
702,39,No,travel_frequently,"443,0$",NaN,8,1,NaN,1,NaN,3,1,48,3,1,lABOrAToRY TEcHniCIan,3,Married,"3755,0",17872,1,Y,No,11,"3,0",1,NaN,1,NaN,3,"3,0",8,NaN,0,7,"3755,0",1984,1000000000$,NaN,NaN,True
1209,40,No,travel_rarely,"896,0$",NaN,2,3,NaN,1,NaN,3,0,68,3,1,REsEArch ScieNtISt,3,NaN,NaN,8045,2,Y,No,14,"3,0",3,NaN,1,NaN,3,"4,0",3,NaN,1,2,NaN,1983,1000000000$,NaN,NaN,0

# Estandarizamos los nombres de columnas: todo en minúsculas y espacios como _

In [43]:
# Primer paso: las columnas de todo en mayuscula, pasamos a minúsculas y separamos las palabras#

rh.rename(columns={'NUMCOMPANIESWORKED':'num_companies_worked', 'TOTALWORKINGYEARS':'total_working_years', 'WORKLIFEBALANCE':'work_life_balance','YEARSWITHCURRMANAGER':'years_with_curr_manager','NUMBERCHILDREN':'number_children'},inplace = True)

In [44]:
rh

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,num_companies_worked,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,total_working_years,TrainingTimesLastYear,work_life_balance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,years_with_curr_manager,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,number_children,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",3,0,51,2,3,saLEs ExeCUTiVe,4,Married,"10325,0",5518,1,Y,NaN,11,NaN,1,NaN,1,NaN,6,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",3,0,57,3,2,LAboRaTOry tECHNiCIAn,2,NaN,"4447,0",23163,1,NaN,NaN,12,"3,0",2,NaN,0,NaN,5,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,13,0,41,4,3,sAlES ExECUTivE,3,Single,NaN,2560,0,NaN,No,18,"3,0",4,NaN,0,"9,0",3,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",1,0,84,3,2,SaLes ExecUtIVe,4,Divorced,NaN,25952,4,NaN,No,13,NaN,4,NaN,2,"12,0",3,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,4,0,75,3,3,mAnUfactURInG DiRECTOr,3,NaN,"10845,0",24208,6,Y,NaN,13,"3,0",2,NaN,1,NaN,3,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [45]:
# Segundo paso:todo en minuscula, añadir barra baja separadora

# Patrón regex para identificar la transición de minúsculas a mayúsculas
patron = '(?<=[a-z])(?=[A-Z])'

# Diccionario para almacenar los nuevos nombres de columna
columnas = {column: re.sub(patron,'_', column) for column in rh.columns}

# Renombrar las columnas usando los nuevos nombres
rh.rename(columns=columnas, inplace=True)

# Convertir los nombres de las columnas a minúsculas
rh.columns = [columna.lower() for columna in rh.columns]

#cambiamos manualmente el nombre de una columna
rh.rename(columns = {'employeenumber': 'employee_number', 'employeecount' : 'employee_count'}, inplace = True )

rh

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_count,employee_number,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,job_role,job_satisfaction,marital_status,monthly_income,monthly_rate,num_companies_worked,over18,over_time,percent_salary_hike,performance_rating,relationship_satisfaction,standard_hours,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager,same_as_monthly_income,date_birth,salary,role_departament,number_children,remote_work
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",3,0,51,2,3,saLEs ExeCUTiVe,4,Married,"10325,0",5518,1,Y,NaN,11,NaN,1,NaN,1,NaN,6,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",3,0,57,3,2,LAboRaTOry tECHNiCIAn,2,NaN,"4447,0",23163,1,NaN,NaN,12,"3,0",2,NaN,0,NaN,5,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,13,0,41,4,3,sAlES ExECUTivE,3,Single,NaN,2560,0,NaN,No,18,"3,0",4,NaN,0,"9,0",3,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",1,0,84,3,2,SaLes ExecUtIVe,4,Divorced,NaN,25952,4,NaN,No,13,NaN,4,NaN,2,"12,0",3,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,4,0,75,3,3,mAnUfactURInG DiRECTOr,3,NaN,"10845,0",24208,6,Y,NaN,13,"3,0",2,NaN,1,NaN,3,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [46]:
rh.dtypes

age                            object
attrition                      object
business_travel                object
daily_rate                     object
department                     object
distance_from_home              int64
education                       int64
education_field                object
employee_count                  int64
employee_number                object
environment_satisfaction        int64
gender                          int64
hourly_rate                    object
job_involvement                 int64
job_level                       int64
job_role                       object
job_satisfaction                int64
marital_status                 object
monthly_income                 object
monthly_rate                    int64
num_companies_worked            int64
over18                         object
over_time                      object
percent_salary_hike             int64
performance_rating             object
relationship_satisfaction       int64
standard_hours                 object
stock_option_level              int64
total_working_years            object
training_times_last_year        int64
work_life_balance              object
years_at_company                int64
years_in_current_role          object
years_since_last_promotion      int64
years_with_curr_manager         int64
same_as_monthly_income         object
date_birth                      int64
salary                         object
role_departament               object
number_children               float64
remote_work                    object
dtype: object

# Acordar estandarización de booleanos : general: Y/N, genre: F/M

In [47]:
# Para género
rh["gender"].replace(to_replace = [0,1], value = ['M', 'F'], inplace = True)

In [48]:
#Para Y/N
rh["over18"].replace(to_replace = [0,1], value = ['N', 'Y'], inplace = True)
rh[["attrition", "over_time"]]= rh[["attrition", "over_time"]].replace(to_replace = ["No","Yes"], value = ['N', 'Y']) #Borrar

In [49]:

rh["remote_work"].replace(to_replace = ["0","1"], value = ['N', 'Y'], inplace = True)
rh["remote_work"].replace(to_replace = ["No","Yes"], value = ['N', 'Y'], inplace = True)
rh["remote_work"].replace(to_replace = ["False","True"], value = ['N', 'Y'], inplace = True)

#Borramos las columnas inservibles

In [50]:
# .drop standard_hours, number_children, salary, over18, employee_count
rh.drop(labels=["standard_hours", "number_children", "salary", "over18", "employee_count", "years_in_current_role", "same_as_monthly_income", "date_birth"], axis = 1, inplace=True)

# years_in_current_role borrada por tener solo 34 datos: insuficiente
# same_as_monthly_income está repetida

Estandarizamos todos los valores en camel

In [51]:
#creamos variable con todas las columnas object

def camelizar (dato):

    try:
        return dato.title()
    except:
        return dato
    
columnas_object_camel = ["age","attrition","business_travel","daily_rate","department","education_field","employee_number","hourly_rate","job_role","marital_status","monthly_income","over_time","performance_rating","total_working_years","work_life_balance","role_departament","remote_work"]

for columnas in columnas_object_camel:
    rh[columnas]=rh[columnas].apply(camelizar)

In [52]:
rh

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_number,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,job_role,job_satisfaction,marital_status,monthly_income,monthly_rate,num_companies_worked,over_time,percent_salary_hike,performance_rating,relationship_satisfaction,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_since_last_promotion,years_with_curr_manager,role_departament,remote_work
0,51,N,NaN,"684,0$",NaN,6,3,NaN,"162,0",1,M,51,3,5,Research Director,3,NaN,"19537,0",6462,7,N,13,"3,0",3,0,NaN,5,"3,0",20,15,15,NaN,Y
1,52,N,NaN,"699,0$",NaN,1,4,Life Sciences,"259,0",3,M,65,2,5,Manager,3,NaN,"19999,0",5678,0,NaN,14,"3,0",1,1,"34,0",5,"3,0",33,11,9,NaN,Y
2,42,N,Travel_Rarely,"532,0$",Research & Development,4,2,Technical Degree,"319,0",3,M,58,3,5,Manager,4,Married,"19232,0",4933,1,N,11,"3,0",4,0,"22,0",3,NaN,22,11,15,Manager - Research & Development,Y
3,47,N,Travel_Rarely,"359,0$",NaN,2,4,Medical,NaN,1,F,82,3,4,Research Director,3,Married,"17169,0",26703,3,NaN,19,"3,0",2,2,NaN,2,NaN,20,5,6,NaN,N
4,46,N,NaN,"1319,0$",NaN,3,3,Technical Degree,NaN,1,F,45,4,4,Sales Executive,1,Divorced,NaN,7739,2,N,12,"3,0",4,1,NaN,5,"3,0",19,2,8,NaN,N
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Y,Travel_Rarely,"530,0$",NaN,3,1,Life Sciences,"967,0",3,M,51,2,3,Sales Executive,4,Married,"10325,0",5518,1,NaN,11,NaN,1,1,NaN,6,"3,0",16,3,7,NaN,N
1610,45,N,Non-Travel,"805,0$",NaN,4,2,NaN,"972,0",3,M,57,3,2,Laboratory Technician,2,NaN,"4447,0",23163,1,NaN,12,"3,0",2,0,NaN,5,"2,0",9,0,8,NaN,Y
1611,39,N,Travel_Rarely,"903,0$",NaN,-13,5,NaN,NaN,13,M,41,4,3,Sales Executive,3,Single,NaN,2560,0,N,18,"3,0",4,0,"9,0",3,"3,0",8,0,7,NaN,Y
1612,36,N,Non-Travel,"1229,0$",NaN,8,4,Technical Degree,"990,0",1,M,84,3,2,Sales Executive,4,Divorced,NaN,25952,4,N,13,NaN,4,2,"12,0",3,"3,0",7,0,7,NaN,Y
1613,46,N,NaN,"566,0$",NaN,7,2,Medical,NaN,4,M,75,3,3,Manufacturing Director,3,NaN,"10845,0",24208,6,NaN,13,"3,0",2,1,NaN,3,"3,0",8,0,7,NaN,N

WorkLifeBalance, performace_rating y monthly_income quitar comas

In [53]:
columnas_sin_comas = ['work_life_balance','performance_rating','monthly_income']
for columna in columnas_sin_comas:
    rh[columna] = rh[columna].str.replace(",",".")

Todos los salarios  quitar $ y pasar tipo a int

In [54]:
columnas_sin_dollar = ['daily_rate']
for columna in columnas_sin_dollar:
    rh[columna] = rh[columna].str.replace('$','').str.replace(",",".")

rh[columna]
rh["daily_rate"]= rh["daily_rate"].astype(float)

/tmp/ipykernel_213/3247174935.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  rh[columna] = rh[columna].str.replace('$','').str.replace(",",".")

Pasamos a int las columnas de hourly_rate, monthly_income, performance_rating, daily_rate(float64)  y work_life_balance (las demás object)

In [63]:
def pasar_a_int(elemento):
    try:
        return int(elemento)
    except (ValueError, TypeError):
        return np.NaN

lista_columnas = ['hourly_rate', 'monthly_income', 'performance_rating', 'work_life_balance'] #'daily_rate'

for columna in lista_columnas:
    rh[columna] = rh[columna].apply(pasar_a_int).astype('int')

# replace de not available por numpyNaN #especificar el texto que sale 
# gestion de nulos
# conversión

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [74]:
rh["hourly_rate"].unique()

array(['51', '65', '58', '82', '45', '99', '91', '64', '55', '68', '49',
       '61', '79', '31', '69', '48', '80', '74', '98', '59', '33', '56',
       '66', '57', '53', '87', '81', '84', '32', '41', '92', '47',
       'Not Available', '43', '86', '30', '42', '88', '96', '67', '62',
       '72', '78', '89', '52', '50', '90', '37', '94', '76', '60', '46',
       '83', '100', '40', '97', '54', '75', '39', '85', '63', '44', '93',
       '36', '35', '73', '71', '70', '38', '77', '95', '34'], dtype=object)

In [61]:
(rh.isnull().sum() / rh.shape[0]) * 100
 #lo convertimos a DataFrame
rh_nulos = pd.DataFrame((rh.isnull().sum() / rh.shape[0]) * 100, columns = ["%_nulos"])
#filtramos para quedarnos solo con las columnas con nulos
rh_nulos[rh_nulos["%_nulos"] > 0]

                       %_nulos
business_travel      47.831475
daily_rate            7.682776
department           81.288724
education_field      46.158612
employee_number      26.703841
marital_status       40.334572
monthly_income       52.230483
over_time            41.883519
performance_rating   12.081784
total_working_years  32.589839
work_life_balance     6.691450
role_departament     81.288724

# Comprobaciones

In [56]:
rh.dtypes

age                            object
attrition                      object
business_travel                object
daily_rate                    float64
department                     object
distance_from_home              int64
education                       int64
education_field                object
employee_number                object
environment_satisfaction        int64
gender                         object
hourly_rate                    object
job_involvement                 int64
job_level                       int64
job_role                       object
job_satisfaction                int64
marital_status                 object
monthly_income                 object
monthly_rate                    int64
num_companies_worked            int64
over_time                      object
percent_salary_hike             int64
performance_rating             object
relationship_satisfaction       int64
stock_option_level              int64
total_working_years            object
training_times_last_year        int64
work_life_balance              object
years_at_company                int64
years_since_last_promotion      int64
years_with_curr_manager         int64
role_departament               object
remote_work                    object
dtype: object

In [57]:
rh.describe(include=object)

,age,attrition,business_travel,department,education_field,employee_number,gender,hourly_rate,job_role,marital_status,monthly_income,over_time,performance_rating,total_working_years,work_life_balance,role_departament,remote_work
count,1614,1614,842,302,869,1183,1614,1614,1614,963,771,938,1419,1088,1506,302,1614
unique,54,2,3,3,6,1079,2,72,9,4,668,2,2,40,4,11,2
top,35,N,Travel_Rarely,Research & Development,Life Sciences,"482,0",M,Not Available,Sales Executive,Married,6347.0,N,3.0,"10,0",3.0,Sales Executive - Sales,Y
freq,84,1355,586,196,349,2,971,84,369,404,4,682,1205,144,913,69,1000

In [58]:
rh.describe()

,daily_rate,distance_from_home,education,environment_satisfaction,job_involvement,job_level,job_satisfaction,monthly_rate,num_companies_worked,percent_salary_hike,relationship_satisfaction,stock_option_level,training_times_last_year,years_at_company,years_since_last_promotion,years_with_curr_manager
count,1490.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000,1614.000000
mean,802.085235,4.527261,2.925031,4.294919,2.739777,2.068154,2.738538,14284.495663,2.673482,15.165428,2.704461,0.791202,2.809789,7.132590,2.245973,4.220570
std,403.246954,14.591913,1.022357,6.993559,0.711567,1.101344,1.106163,7110.414585,2.506152,3.648610,1.079031,0.842396,1.297765,6.124237,3.235665,3.562695
min,103.000000,-49.000000,1.000000,1.000000,1.000000,1.000000,1.000000,2094.000000,0.000000,11.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,468.250000,2.000000,2.000000,2.000000,2.000000,1.000000,2.000000,8001.000000,1.000000,12.000000,2.000000,0.000000,2.000000,3.000000,0.000000,2.000000
50%,798.000000,5.000000,3.000000,3.000000,3.000000,2.000000,3.000000,14248.500000,2.000000,14.000000,3.000000,1.000000,3.000000,5.000000,1.000000,3.000000
75%,1157.000000,11.000000,4.000000,4.000000,3.000000,3.000000,4.000000,20364.000000,4.000000,18.000000,4.000000,1.000000,3.000000,9.000000,3.000000,7.000000
max,1499.000000,29.000000,5.000000,49.000000,4.000000,5.000000,4.000000,26999.000000,9.000000,25.000000,4.000000,3.000000,6.000000,40.000000,15.000000,17.000000

In [59]:
rh

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_number,environment_satisfaction,gender,hourly_rate,job_involvement,job_level,job_role,job_satisfaction,marital_status,monthly_income,monthly_rate,num_companies_worked,over_time,percent_salary_hike,performance_rating,relationship_satisfaction,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_since_last_promotion,years_with_curr_manager,role_departament,remote_work
0,51,N,NaN,684.0,NaN,6,3,NaN,"162,0",1,M,51,3,5,Research Director,3,NaN,19537.0,6462,7,N,13,3.0,3,0,NaN,5,3.0,20,15,15,NaN,Y
1,52,N,NaN,699.0,NaN,1,4,Life Sciences,"259,0",3,M,65,2,5,Manager,3,NaN,19999.0,5678,0,NaN,14,3.0,1,1,"34,0",5,3.0,33,11,9,NaN,Y
2,42,N,Travel_Rarely,532.0,Research & Development,4,2,Technical Degree,"319,0",3,M,58,3,5,Manager,4,Married,19232.0,4933,1,N,11,3.0,4,0,"22,0",3,NaN,22,11,15,Manager - Research & Development,Y
3,47,N,Travel_Rarely,359.0,NaN,2,4,Medical,NaN,1,F,82,3,4,Research Director,3,Married,17169.0,26703,3,NaN,19,3.0,2,2,NaN,2,NaN,20,5,6,NaN,N
4,46,N,NaN,1319.0,NaN,3,3,Technical Degree,NaN,1,F,45,4,4,Sales Executive,1,Divorced,NaN,7739,2,N,12,3.0,4,1,NaN,5,3.0,19,2,8,NaN,N
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Y,Travel_Rarely,530.0,NaN,3,1,Life Sciences,"967,0",3,M,51,2,3,Sales Executive,4,Married,10325.0,5518,1,NaN,11,NaN,1,1,NaN,6,3.0,16,3,7,NaN,N
1610,45,N,Non-Travel,805.0,NaN,4,2,NaN,"972,0",3,M,57,3,2,Laboratory Technician,2,NaN,4447.0,23163,1,NaN,12,3.0,2,0,NaN,5,2.0,9,0,8,NaN,Y
1611,39,N,Travel_Rarely,903.0,NaN,-13,5,NaN,NaN,13,M,41,4,3,Sales Executive,3,Single,NaN,2560,0,N,18,3.0,4,0,"9,0",3,3.0,8,0,7,NaN,Y
1612,36,N,Non-Travel,1229.0,NaN,8,4,Technical Degree,"990,0",1,M,84,3,2,Sales Executive,4,Divorced,NaN,25952,4,N,13,NaN,4,2,"12,0",3,3.0,7,0,7,NaN,Y
1613,46,N,NaN,566.0,NaN,7,2,Medical,NaN,4,M,75,3,3,Manufacturing Director,3,NaN,10845.0,24208,6,NaN,13,3.0,2,1,NaN,3,3.0,8,0,7,NaN,N

In [73]:
pd.set_option('display.max_rows', None)


rh['distance_from_home'].value_counts()

 2     217
 1     203
 10     86
 9      85
 8      81
 7      80
 3      79
 5      62
 6      61
 4      61
 16     30
 11     28
 15     27
 23     26
 29     25
 25     24
 24     24
 18     22
 26     22
 14     21
 12     21
 21     19
 17     19
 13     19
 20     18
 28     17
 22     16
 19     16
 27     13
-13     11
-12     11
-24     11
-18      8
-47      7
-35      7
-38      7
-19      6
-36      6
-14      6
-31      6
-26      6
-25      6
-42      6
-22      5
-45      5
-48      5
-10      5
-46      5
-16      5
-27      4
-30      4
-20      4
-29      4
-41      4
-32      4
-37      4
-17      3
-11      3
-15      3
-23      3
-33      3
-44      3
-21      2
-49      2
-28      2
-34      2
-43      2
-39      1
-40      1
Name: distance_from_home, dtype: int64